Revit 2027 API
LoadBase.LoadCaseId Property
 The load case ID for the load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LoadCaseId { get; set; }
Public Property LoadCaseId As ElementId
	Get
	Set
public:
property ElementId^ LoadCaseId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LoadCaseId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace